# -*- coding: utf-8 -*-

from __future__ import unicode_literals

from .lang_EU import Num2Word_EU


class Num2Word_ML(Num2Word_EU):
    def set_high_numwords(self, high):
        for n, word in self.high_numwords:
            self.cards[10**n] = word

    def setup(self):
        self.low_numwords = [
            "തൊണ്ണൂറ്റി ഒൻപത്",
            "തൊണ്ണൂറ്റി എട്ട്",
            "തൊണ്ണൂറ്റി ഏഴ്",
            "തൊണ്ണൂറ്റി ആറ്",
            "തൊണ്ണൂറ്റി അഞ്ച്",
            "തൊണ്ണൂറ്റി നാല്",
            "തൊണ്ണൂറ്റി മൂന്ന്",
            "തൊണ്ണൂറ്റി രണ്ട്",
            "തൊണ്ണൂറ്റി ഒന്ന്",
            "തൊണ്ണൂറ്",
            "എൺപത്തി ഒൻപത്",
            "എൺപത്തി എട്ട്",
            "എൺപത്തി ഏഴ്",
            "എൺപത്തി ആറ്",
            "എൺപത്തി അഞ്ച്",
            "എൺപത്തി നാല്",
            "എൺപത്തി മൂന്ന്",
            "എൺപത്തി രണ്ട്",
            "എൺപത്തി ഒന്ന്",
            "എൺപത്",
            "എഴുപത്തി ഒൻപത്",
            "എഴുപത്തി എട്ട്",
            "എഴുപത്തി ഏഴ്",
            "എഴുപത്തി ആറ്",
            "എഴുപത്തി അഞ്ച്",
            "എഴുപത്തി നാല്",
            "എഴുപത്തി മൂന��ന്",
            "എഴുപത്തി രണ്ട്",
            "എഴുപത്തി ഒന്ന്",
            "എഴുപത്",
            "അറുപത്തി ഒൻപത്",
            "അറുപത്തി എട്ട്",
            "അറുപത്തി ഏഴ്",
            "അറുപത്തി ആറ്",
            "അറുപത്തി അഞ്ച്",
            "അറുപത്തി നാല്",
            "അറുപത്തി മൂന്ന്",
            "അറുപത്തി രണ്ട്",
            "അറുപത്തി ഒന്ന്",
            "അറുപത്",
            "അൻപത്തി ഒൻപത്",
            "അൻപത്തി എട്ട്",
            "അൻപത്തി ഏഴ്",
            "അൻപത്തി ആറ്",
            "അൻപത്തി അഞ്ച്",
            "അൻപത്തി നാല്",
            "അൻപത്തി മൂന്ന്",
            "അൻപത്തി രണ്ട്",
            "അൻപത്തി ഒന്ന്",
            "അൻപത്",
            "നാല്പത്തി ഒൻപത്",
            "നാല്പത്തി എട്ട്",
            "നാല്പത്തി ഏഴ്",
            "നാല്പത്തി ആറ്",
            "നാല്പത്തി അഞ്ച്",
            "നാല്പത്തി നാല്",
            "നാല്പത്തി മൂന്ന്",
            "നാല്പത്തി രണ്ട്",
            "നാല്പത്തി ഒന്ന്",
            "നാല്പത്",
            "മുപ്പത്തി ഒൻപത്",
            "മുപ്പത്തി എട്ട്",
            "മുപ്പത്തി ഏഴ്",
            "മുപ്പത്തി ആറ്",
            "മുപ്പത്തി അഞ്ച്",
            "മുപ്പത്തി നാല്",
            "മുപ്പത്തി മൂന്ന്",
            "മുപ്പത്തി രണ്ട്",
            "മുപ്പത്തി ഒന്ന്",
            "മുപ്പത്",
            "ഇരുപത്തി ഒൻപത്",
            "ഇരുപത്തി എട്ട്",
            "ഇരുപത്തി ഏഴ്",
            "ഇരുപത്തി ആറ്",
            "ഇരുപത്തി അഞ്ച്",
            "ഇരുപത്തി നാല്",
            "ഇരുപത്തി മൂന്ന്",
            "ഇരുപത്തി രണ്ട്",
            "ഇരുപത്തി ഒന്ന്",
            "ഇരുപത്",
            "പത്തൊൻപത്",
            "പതിനെട്ട്",
            "പതിനേഴ്",
            "പതിനാറ്",
            "പതിനഞ്ച്",
            "പതിനാല്",
            "പതിമൂന്ന്",
            "പന്ത്രണ്ട്",
            "പതിനൊന്ന്",
            "പത്ത്",
            "ഒൻപത്",
            "എട്ട്",
            "ഏഴ്",
            "ആറ്",
            "അഞ്ച്",
            "നാല്",
            "മൂന്ന്",
            "രണ്ട്",
            "ഒന്ന്",
            "പൂജ്യം",
        ]

        self.mid_numwords = [(100, "നൂറ്")]

        self.high_numwords = [(7, "കോടി"), (5, "ലക്ഷം"), (3, "ആയിരം")]

        self.pointword = "പൂർണം"

        self.modifiers = []

    def merge(self, lpair, rpair):
        ltext, lnum = lpair
        rtext, rnum = rpair
        if lnum == 1 and rnum < 100:
            return (rtext, rnum)
        elif 100 > lnum > rnum:
            return ("%s %s" % (ltext, rtext), lnum + rnum)
        elif lnum >= 100 > rnum:
            return ("%s %s" % (ltext, rtext), lnum + rnum)
        elif rnum > lnum:
            return ("%s %s" % (ltext, rtext), lnum * rnum)
        return ("%s %s" % (ltext, rtext), lnum + rnum)

    def to_ordinal(self, value):
        self.verify_ordinal(value)
        outword = self.to_cardinal(value)
        return outword + "ആമത്"

    def to_ordinal_num(self, value):
        self.verify_ordinal(value)
        return str(value) + "ആമത്"
